000001
000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. HELLO-WORLD.
000004 PROCEDURE DIVISION.
000005     DISPLAY "Voir le fichier cobol-2.cob"
000006     DISPLAY "Les lignes sont numérotées dans le programme"
000007     DISPLAY "Avantage : compatibilité avec les anciens codes !"
000008             "Avec les nouveaux IDE, il n'est plus nécessaire"
000009             "de numéroter les lignes."
000010     DISPLAY "Inconvénient : dans les gros programmes,"
000011             "modifier une ligne au milieu oblige parfois à "
000012             "corriger les numéros des lignes suivantes."
000013     DISPLAY "Il y a peu d'intérêt à conserver ces numéros."
000014     DISPLAY "Même avec des numéros répétés, le programme"
000015     DISPLAY "fonctionne correctement !"
000016     STOP RUN.