       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       PROCEDURE DIVISION.
           DISPLAY "Bonjour et bienvenue sur le Terminal COBOL!"
           STOP RUN.
